
// Чтобы мобильный клиент не мог вносить несанкционированные изменения в справочник
&НаКлиенте
Процедура СписокПередУдалением(Элемент, Отказ, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь; // Отключаем стандартную обработку
    Отказ = Истина; // Запрещаем удаление
    ПоказатьПредупреждение(, "Удаление элементов справочника запрещено!");
КонецПроцедуры

// Если пользователь нее авторизован, то он не имеет доступ к справочникам и документам
&НаКлиенте
Процедура ПриОткрытии()
	
	Если СервисАвторизации.ПолучениеПараметраСеансаАдминистратора() Тогда 
		// Вывод сообщения, что доступ разрешен	
		Сообщить("Доступ разрешен");
			
	Иначе 
		// Вывод исключение не позволяющее просмотреть нанные в справочниках и документах	
		ВызватьИсключение "Эта форма не доступна";
			
	КонецЕсли;
	
КонецПроцедуры
