
// Процедура выполняется на сервере при формировании данных формы элемента
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

    // Проверяем, запущено ли данное приложение на мобильном устройстве
    Если ПараметрыСеанса.ЭтоМобильныйКлиент Тогда 
        
        // Делаем поля "Код" и "Наименование" доступными только для чтения
        // Пользователю мобильного устройства не разрешены изменения значений этих полей
        Элементы.Код.ТолькоПросмотр = Истина;
        Элементы.Наименование.ТолькоПросмотр = Истина;
    
    Иначе 
        // Диагностическое сообщение, выводится только на рабочем столе или браузере
        Сообщить("Это сервер");
    
    КонецЕсли;
КонецПроцедуры

