//Этот модульотвечает за осуществление соединения с web сервисом

//Осуществление подключения к серверу
&НаСервере
Функция ПодключитьсяКВебСервису(АдресЦентральнойБазы, Результат) Экспорт 
    Попытка
        WSОпределения = Новый WSОпределения(АдресЦентральнойБазы);
        WSПрокси = Новый WSПрокси(WSОпределения, ПолучениеДанныхДляСоединения.ПолучитьПроостранствоИмен(), "AuthService", "AuthServiceSoap");
        Возврат WSПрокси;
    Исключение
        Результат.Ошибка = "Ошибка подключения1: " + ОписаниеОшибки() + АдресЦентральнойБазы;
        Возврат Неопределено;
    КонецПопытки;
КонецФункции

//Фунцкия проверки связи с сервером, перед осуществлением обмена
&НаСервере
Функция ПроверитьСвязьССервером() Экспорт
    Попытка
        WSОпределения = Новый WSОпределения(ПолучениеДанныхДляСоединения.ПолучитьURLЦентральнойБазы());
        WSПрокси = Новый WSПрокси(WSОпределения, ПолучениеДанныхДляСоединения.ПолучитьПроостранствоИмен(), "AuthService", "AuthServiceSoap");
        Возврат Истина;
    Исключение
        Возврат Ложь;
    КонецПопытки;
КонецФункции