// Модуль формы справочника ЛокальныеУведомления (ФормаЭлемента)
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ПараметрыСеанса.ЭтоМобильныйКлиент Тогда 
        Элементы.ДатаПоездки.ТолькоПросмотр = Истина;
		Элементы.ПоездкаНачалась.ТолькоПросмотр = Истина;
		Элементы.ПоездкаЗавершена.ТолькоПросмотр = Истина;
		Элементы.Маршрут.ТолькоПросмотр = Истина;
		Элементы.КоличествоМест.ТолькоПросмотр = Истина;
		Элементы.КоличествоЗанятыхМест.ТолькоПросмотр = Истина;
		Элементы.Водитель.ТолькоПросмотр = Истина;
		Элементы.Дата.ТолькоПросмотр = Истина;
		Элементы.Номер.ТолькоПросмотр = Истина;
	Иначе 
		Сообщить("Это сервер");
	КонецЕсли;
		
КонецПроцедуры