///// Модуль формы справочника ЛокальныеУведомления (ФормаЭлемента или ФормаСписка) /////

&НаКлиенте
Процедура ПриОткрытии(Отказ)
    #Если Не МобильноеПриложениеКлиент Тогда
        // Скрываем форму в немобильных клиентах
        Отказ = Истина;
        ВывестиПредупреждение("Справочник ЛокальныеУведомления доступен только в мобильном клиенте!");
    #КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ВывестиПредупреждение(ТекстСообщения) Экспорт
    ПоказатьПредупреждение(, НСтр("ru='" + ТекстСообщения + "'"));
КонецПроцедуры
