// Форма появляется при первом входе в приложение, где необходимо ввести адрес сервера и пространство имен
&НаКлиенте
Процедура Готово(Команда)
    
    // Проверка заполненности полей    
    Если ПустаяСтрока(НаборКонстант.АдресЦентральнойБазы) Тогда
        ПоказатьПредупреждение(, "Заполните поле Адрес центральной базы!");
        Возврат;
	КонецЕсли;
	
	// Проверка заполненности полей    
    Если ПустаяСтрока(НаборКонстант.ПространствоИменВебСервиса) Тогда
        ПоказатьПредупреждение(, "Заполните поле Пространство имен веб сервиса!");
        Возврат;
	КонецЕсли;
	
	// Записываем изменения в константы, запись узлов осуществляется автоматически и генераруется на сервере, 
	// отправляется клиенту и записывается в соответствующие константы
    Попытка        
        ЗаписатьКонстантыИОбновитьПланОбменаНаСервере();
        Закрыть(); // Закрываем форму
		ОткрытьФорму("ОбщаяФорма.Авторизация");
		СервисАвторизации.ПроверкаУзла();
    Исключение
        ПоказатьПредупреждение(, "Ошибка при сохранении данных: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

// Обработка закрытия формы
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
    // Отключаем запрос на сохранение изменений при закрытии формы
    Если Модифицированность Тогда
        Модифицированность = Ложь; // Сбрасываем модифицированность
    КонецЕсли;
КонецПроцедуры

// Процедура сохранения изменения на локальном устройстве адреса сервера и пространства имен
&НаСервере
Процедура ЗаписатьКонстантыИОбновитьПланОбменаНаСервере()
    
    // Запись значений констант
    Попытка
        Константы.АдресЦентральнойБазы.Установить(НаборКонстант.АдресЦентральнойБазы);
		Константы.ПространствоИменВебСервиса.Установить(НаборКонстант.ПространствоИменВебСервиса);
        // Сбрасываем модифицированность формы после сохранения
        Модифицированность = Ложь;
    Исключение
        ВызватьИсключение "Не удалось записать константы: " + ОписаниеОшибки();
	КонецПопытки;
КонецПроцедуры