//Модуль отвечает за начало работы системы

// При начала работы происходит проверка адреса сервера, узла обмена, если они есть, то
// происходит обмен с сервером
&НаКлиенте
Процедура ПриНачалеРаботыСистемы()
	
	// Если это мобильный клиент
	Если ЭтоМобильноеПриложениеКлиент() Тогда
		СервисАвторизации.ПараметрАдминистратора(Ложь);
		СервисАвторизации.ПроверитьУстройства(Истина);
		// Если параметры подключения есть, то происходит переход на панель автоиизации, иначе
		// необходимо вписать параметры для подключения к центральной базе данных
        Если СервисАвторизации.ПроверитьКонстанты() Тогда
            СервисАвторизации.ПроверкаУзла();
            ОткрытьФорму("ОбщаяФорма.Авторизация");
		Иначе
            ОткрытьФорму("ОбщаяФорма.ДобавитьURL");
		КонецЕсли;
	Иначе
		СервисАвторизации.ПараметрАдминистратора(Ложь);
		СервисАвторизации.ПроверитьУстройства(Ложь);
		ОткрытьФорму("ОбщаяФорма.Авторизация");	
		
	КонецЕсли;
	
КонецПроцедуры

// Проверка на мобильный клиент
&НаКлиенте
Функция ЭтоМобильноеПриложениеКлиент()
    #Если МобильноеПриложениеКлиент Тогда
        Возврат Истина;
    #Иначе
        Возврат Ложь;
    #КонецЕсли
КонецФункции