// Позволяет на мобильном клиентпе сделать поля не доступными для редактирования пользователем 
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    // Условие проверки типа клиента (если это мобильное устройство)
    Если ПараметрыСеанса.ЭтоМобильныйКлиент Тогда 
        
        // Устанавливаем свойство "Только просмотр" для элементов формы,
        // чтобы запретить редактирование на мобильных устройствах
        Элементы.Код.ТолькоПросмотр = Истина;       
        Элементы.Наименование.ТолькоПросмотр = Истина;   
        Элементы.Роль.ТолькоПросмотр = Истина;     
        Элементы.Логин.ТолькоПросмотр = Истина;     
        Элементы.Пароль.ТолькоПросмотр = Истина;    
    
    Иначе 
        // Отображаем сообщение на экране, если проверка выполняется на сервере
        Сообщить("Это сервер");                  
    
    КонецЕсли;

КонецПроцедуры
