Процедура ПриЗаписи(Отказ)
	Если ОбменДанными.Загрузка Тогда
        Возврат; // Пропускаем, если это загрузка данных
    КонецЕсли;
    
    Попытка
        УзелОбмена = ПланыОбмена.Мобильные.НайтиПоКоду(ПолучитьКодУзлаЦентральнойБазы());
        Если УзелОбмена.Пустая() Тогда
            Возврат;
        КонецЕсли;
        
        //ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ЭтотОбъект);
		Обработка(УзелОбмена, ЭтотОбъект);
    Исключение
        Сообщить("Ошибка при регистрации изменений: " + ОписаниеОшибки());
    КонецПопытки;
КонецПроцедуры

Процедура Обработка(УзелОбмена, ЭтотОбъект)
	
	 ОбработкаНаСервере(УзелОбмена, ЭтотОбъект);
	
КонецПроцедуры
 
 &НаСервере
Процедура ОбработкаНаСервере(УзелОбмена, ЭтотОбъект)
	
	ПланыОбмена.ЗарегистрироватьИзменения(УзелОбмена, ЭтотОбъект);
	СинхронизацияМобильногоУстройства.ОтправитьИзмененияНаСервер();
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКодУзлаЦентральнойБазы()
    Попытка
        Возврат Константы.КодУзлаЦентральнойБазы.Получить();
    Исключение
        Возврат "";
    КонецПопытки;
КонецФункции

