// Модуль отвечает за отмену поездки для текущего пользователя
&НаКлиенте
Процедура ОтменитьПоездкуБезПроверкиСети(Поездка, ТекущийПользователь, СтатусПоездки)Экспорт 
	
	// Проверяем статус поездки
	Если СтатусПоездки <> "Поездка не началась" Тогда
    	ПоказатьПредупреждение(, "Статус поездки должен быть в статусе поездка не началась!");
    	Возврат;
	КонецЕсли;
	
	// Передача параметров в форму ВыборОстановок
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Поездка", Поездка);
	ПараметрыФормы.Вставить("Пользователь", ТекущийПользователь);
	
	ОткрытьФорму("ОбщаяФорма.ВыборОтменитьПоездку", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры